//第 1 题（单选题）
//题目名称：
//将二进制数101011转换为十进制数时，其值是多少？ B
//
//题目内容：
//A .11
//B .43
//C .85
//D .101
//第 2 题（单选题）
//题目名称：
//将十六进制数3F转换为二进制数时，其结果是什么？ A
//
//题目内容：
//A .111111
//B .001111
//C .110011
//D .111100
//第 3 题（单选题）
//题目名称：
//将十进制数 -5转换为8位二进制补码时，其表示为： C
//
//题目内容：
//A .00000101
//B .10000010
//C .11111011
//D .11111101
//第 4 题（单选题）
//题目名称：
//原码、反码、补码说法错误的是（D）
//
//题目内容：
//A.一个数的原码是这个数直接转换成二进制
//B.反码是原码的二进制符号位不变，其他位按位取反
//C.补码是反码的二进制加1
//D.原码、反码、补码的最高位是0表示负数，最高位是1表示正数
//第 5 题（单选题）
//题目名称：
//假设在C语言中，有两个整数变量x = 9和y = 3，表达式x ^ y的结果是什么？ C
//
//题目内容：
//A .6
//B .12
//C .10
//D .0
//第 6 题（单选题）
//题目名称：
//假设在C语言中，有两个整数变量a = 12和b = 5，表达式a & b的结果是什么？B
//题目内容：
//A .0
//B .4
//C .5
//D .12
//第 7 题（单选题）
//题目名称：
//在C语言中，算术右移运算符（ >> ）用于将一个数的各个位向右移动指定的位数，空出的位用什么填充？C
//
//题目内容：
//A .0
//B .1
//C.符号位
//D.随机值
//第 8 题（单选题）
//题目名称：
//左移运算符（ << ）将一个数的各个位向左移动指定的位数，空出的位用什么填充？A
//
//题目内容：
//A .0
//B .1
//C.符号位
//D.随机值
//第 9 题（单选题）
//题目名称：
//下面哪个是位操作符：（A）
//
//题目内容：
//A . &
//B . &&
//C . ||
//D .!
//第 10 题（单选题）
//题目名称：
//在C语言中，以下哪个运算符具有最低的优先级？D
//
//题目内容：
//A.逻辑与（ && ）
//B.位异或（ ^ ）
//C.逻辑或（ || ）
//D.赋值（ = ）