//第 2 题（单选题）
//题目名称：
//1. 下列数据结构中，不属于线性表的是（  D  ）
//
//题目内容：
//A.循环队列
//B.链表
//C.动态顺序表
//D.二叉树
// 
//第 3 题（单选题）
//题目名称：
//3. 动态顺序表中，（ B ）操作需要检查是否需要扩容
//
//题目内容：
//A.删除
//B.插入
//C.初始化
//D.清空
// 
//第 4 题（单选题）
//题目名称：
//2. 在长度为 n 的顺序表下标为 i 的位置前插入一个元素（1 ≤ i ≤ n + 1），元素的移动次数为（ B ）
//题目内容：
//A.n - i + 1
//B.n - i
//C.i
//D.i - 1
// 
//第 5 题（单选题）
//题目名称：
//4. 下列关于链表的说法哪个是正确的？（ A ）
//题目内容：
//A.插入或删除时，无需移动其他元素
//B.数据在内存中一定是连续的
//C.需要事先估计存储空间
//D.可以随机访问表内的元素
// 
//第 6 题（单选题）
//题目名称：
//5. 在单链表指针为p的结点之后插入指针为s的结点，正确的操作是（ C ）
//
//题目内容：
//A.p->next = s; s->next = p->next;
//B.p->next = s->next; p->next = s;
//C.s->next = p->next; p->next = s;
//D.p->next = s->next; p->next = s;
// 
//第 7 题（单选题）
//题目名称：
//6. 在一个单链表中，q 的前一个节点为 p，删除 q 所指向节点时，以下代码正确的执行语句及次序是（ D ）
//①`q- > next = p->next;`
//②`p- > next = q->next;`
//③`delete p;`
//④`delete q;`
//
//题目内容：
//A.②③
//B.④
//C.①④
//D.②④