
//第 2 题（单选题）
//题目名称：
//1.下列关于堆的叙述错误的是（ C ）
//
//题目内容：
//A.堆是一种完全二叉树
//B.堆通常使用顺序表存储
//C.小堆指的是左右孩子结点都比根结点小的堆
//D.堆的删除是将尾部结点放到队顶后执行向下调整算法
//
//第 3 题（单选题）
//题目名称：
//2.下列关键字序列中，序列（ D ）是堆。
//
//题目内容：
//A .{16，72，31，23，94，53}
//B .{94，23，31，72，16，53}
//C .{16，53，23，94，31，72}
//D .{16，23，53，31，94，72}
// 
//第 4 题（单选题）
//题目名称：
//3.下列关于向下调整算法的说法正确的是（ B ）
//
//题目内容：
//A.构建堆的时候要对每个结点都执行一次
//B.删除操作时要执行一次
//C.插入操作时要执行一次
//D.以上说法都不正确
// 
//第 5 题（单选题）
//题目名称：
//4.在一个堆中，根节点从0开始编号，下标为 i（i > 0） 的结点的左右孩子结点及父结点的下标分别是（ C ）
//
//题目内容：
//A .2 i、2 i + 1、i / 2
//B .2i、2i + 1、(i - 1) / 2
//C .2i + 1、2i + 2、(i - 1) / 2
//D .2i + 1、2i + 2、i / 2 - 1