//第 1 题（单选题）
//题目名称：
//函数调用exec((vl，v2)，(v3，v4)，v5，v6);中，实参的个数是：（ B ）
//
//题目内容：
//A .3
//B .4
//C .5
//D .6
// 
//第 2 题（单选题）
//题目名称：
//关于实参和形参描述错误的是：（ C ）
//
//题目内容：
//A.形参是实参的一份临时拷贝
//B.形参是在函数调用的时候才实例化，才开辟内存空间
//C.改变形参就是改变实参
//D.函数调用如果采用传值调用，改变形参不影响实参
// 
//第 3 题（单选题）
//题目名称：
//在函数调用时，以下说法正确的是：（ B ）
//
//题目内容：
//A.函数调用后必须带回返回值
//B.实际参数和形式参数可以同名
//C.函数间的数据传递不可以使用全局变量
//D.主调函数和被调函数总是在同一个文件里
// 
//第 4 题（单选题）
//题目名称：
//关于函数的声明和定义说法正确的是：（ B ）
//
//题目内容：
//A.函数的定义必须放在函数的使用之前
//B.函数必须保证先声明后使用
//C.函数定义在使用之后，也可以不声明
//D.函数的声明就是说明函数是怎么实现的
// 
//第 5 题（单选题）
//题目名称：
//关于return语句说法正确的是哪个？ C
//
//题目内容：
//A.函数中必须有return语句
//B.在函数中return语句必须返回值，不能使用return;
//C.return语句执行后，return语句后边还有代码则不在执行。
//D.return可以返回函数中定义的数组