//
//第 1 题（单选题）
//题目名称：
//以下能对二维数组a进行正确初始化的语句是：（B）
//
//题目内容：
//A .int a[2][] = { {0,1,2},{3,4,5} };
//B .int a[][3] = { {0,1,2},{3,4,5} };
//C .int a[2][4] = { {0,1,2},{3,4},{5} };
//D .int a[][3] = { {0,,2},{},{3,4,5} };
// 
//第 2 题（单选题）
//题目名称：
//若定义int a[2][3] = { 1,2,3,4,5,6 };则值为4的数组元素是 (B)
//
//题目内容：
//A.a[0][0]
//B.a[1][0]
//C.a[1][1]
//D.a[2][1]

//第 3 题（单选题）
//题目名称：
//在C语言中，以下哪个选项描述了变长数组（Variable Length Array，VLA）的特点？ C
//
//题目内容：
//A.变长数组的大小在编译时确定，不能改变。
//B.变长数组的大小 可能 在运行时确定，比如使用变量来指定数组大小，一旦确定大小后，它的大小是固定的，无法改变。
//C.一旦确定大小后，它的大小是固定的，无法改变
//D.变长数组只能用于存储字符类型的数据。

//第 11 题（单选题）
//题目名称：
//关于C语言函数描述正确的是：（C）
//
//题目内容：
//A.函数必须有参数和返回值
//B.函数的实参只能是变量
//C.库函数的使用必须要包含对应的头文件
//D.有了库函数就不需要自定函数了
// 
//第 12 题（单选题）
//题目名称：
//以下叙述中不正确的是：（D）
//
//题目内容：
//A.在不同的函数中可以使用相同名字的变量
//B.函数中的形式参数是在栈中保存
//C.在一个函数内定义的变量只在本函数范围内有效
//D.在一个函数内复合语句中定义的变量在本函数范围内有效（复合语句指函数中的成对括号构成的代码）
// 
//第 13 题（单选题）
//题目名称：
//以下关于函数设计不正确的说法是：（B）
//
//题目内容：
//A.函数设计应该追求高内聚低耦合
//B.要尽可能多的使用全局变量
//C.函数参数不易过多
//D.设计函数时，尽量做到谁申请的资源就由谁来释放